sdk-php/tests/MercadoPago/Resources/Mocks/Response/Invoice/invoice_list.json

{
    "paging": {
        "offset": 0,
        "limit": 20,
        "total": 1
    },
    "results": [
        {
            "id": 6114264375,
            "type": "scheduled",
            "date_created": "2022-01-01T11:12:25.892-04:00",
            "last_modified": "2022-01-01T11:12:25.892-04:00",
            "preapproval_id": "2c938084726fca480172750000000000",
            "reason": "Yoga classes",
            "external_reference": "YG-23546246234",
            "currency_id": "ARS",
            "transaction_amount": 10,
            "debit_date": "2022-01-01T11:12:25.892-04:00",
            "retry_attempt": 4,
            "status": "scheduled",
            "summarized": "pending",
            "payment": {
                "id": 19951521071,
                "status": "approved",
                "status_detail": "accredited"
            }
        }
    ]
}
